---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingSingleLineLoopLiesOnAxis
source: html/d364943c-344a-5e69-47e3-917a3308d86c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingSingleLineLoopLiesOnAxis Property

The highlighted lines lie on the axis.

## Syntax (C#)
```csharp
public static FailureDefinitionId SculptingSingleLineLoopLiesOnAxis { get; }
```